nxp-mcuxpresso/mcux-soc-svd/MCXN537/MCXN537_cm33_core0.xml
        <register>
          <name>R_SMW_SETTING1</name>
          <description>BIST SMW Setting 1 Register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x315CE2A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMWPARM1</name>
              <description>SMW Parameter Set 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SMP_WHV0</name>
          <description>BIST SMP WHV Setting 0 Register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77777765</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPWHV0</name>
              <description>SMP WHV Parameter Set 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SMP_WHV1</name>
          <description>BIST SMP WHV Setting 1 Register</description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77777777</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMPWHV1</name>
              <description>SMP WHV Parameter Set 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SME_WHV0</name>
          <description>BIST SME WHV Setting 0 Register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCCBA9876</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMEWHV0</name>
              <description>SME WHV Parameter Set 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SME_WHV1</name>
          <description>BIST SME WHV Setting 1 Register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xCCCCCCCC</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMEWHV1</name>
              <description>SME WHV Parameter Set 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SMW_SETTING2</name>
          <description>BIST SMW Setting 2 Register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA80151</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMWPARM2</name>
              <description>SMW Parameter Set 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_D_MISR0</name>
          <description>BIST DIN MISR 0 Register</description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATASIG0</name>
              <description>Data Signature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_A_MISR0</name>
          <description>BIST Address MISR 0 Register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADRSIG0</name>
              <description>Address Signature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_C_MISR0</name>
          <description>BIST Control MISR 0 Register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRLSIG0</name>
              <description>Control Signature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_SMW_SETTING3</name>
          <description>BIST SMW Setting 3 Register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1BE00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMWPARM3</name>
              <description>SMW Parameter Set 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL1</name>
          <description>BIST Data Control 1 Register</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA1</name>
              <description>BIST Data 1 Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL2</name>
          <description>BIST Data Control 2 Register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA2</name>
              <description>BIST Data 2 Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL3</name>
          <description>BIST Data Control 3 Register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA3</name>
              <description>BIST Data 3 Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_REPAIR0_0</name>
          <description>BIST Repair 0 for Block 0 Register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS0_0</name>
              <description>Control Repair 0 in Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz337</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz338</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR0_0</name>
              <description>XADR for Repair 0 in Block 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_REPAIR0_1</name>
          <description>BIST Repair 1 Block 0 Register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS0_1</name>
              <description>Control Repair 1 in Block 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz339</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz340</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR0_1</name>
              <description>XADR for Repair 1 in Block 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_REPAIR1_0</name>
          <description>BIST Repair 0 Block 1 Register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS1_0</name>
              <description>Control Repair 0 in Block 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz341</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz342</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR1_0</name>
              <description>XADR for Repair 0 in Block 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_REPAIR1_1</name>
          <description>BIST Repair 1 Block 1 Register</description>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS1_1</name>
              <description>Control Repair 1 in Block 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz343</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz344</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR1_1</name>
              <description>XADR for Repair 1 in Block 1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL0_EX</name>
          <description>BIST Data Control 0 Extension Register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA0X</name>
              <description>BIST Data 0 High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_TIMER_CTRL_EX</name>
          <description>BIST Timer Control Extension Register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TLVSDLY_H</name>
              <description>Tlvs Time Delay Scalar High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DOUT_QUERY1</name>
          <description>BIST DOUT Query 1 Register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOUT</name>
              <description>Failing DOUT High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_D_MISR1</name>
          <description>BIST DIN MISR 1 Register</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATASIG1</name>
              <description>MISR Data Signature High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_A_MISR1</name>
          <description>BIST Address MISR 1 Register</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADRSIG1</name>
              <description>MISR Address Signature High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_C_MISR1</name>
          <description>BIST Control MISR 1 Register</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRLSIG1</name>
              <description>MISR Control Signature High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL1_EX</name>
          <description>BIST Data Control 1 Extension Register</description>
          <addressOffset>0x36C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA1X</name>
              <description>BIST Data 1 High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL2_EX</name>
          <description>BIST Data Control 2 Extension Register</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA2X</name>
              <description>BIST Data 2 High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R_DATA_CTRL3_EX</name>
          <description>BIST Data Control 3 Extension Register</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA3X</name>
              <description>BIST Data 3 High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_TIMER_OPTION</name>
          <description>SMW Timer Option Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_CDIVL</name>
              <description>Clock Divide Scalar for Long Pulse</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMW_TVFY</name>
              <description>Timer Adjust for Verify</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_SETTING_OPTION0</name>
          <description>SMW Setting Option 0 Register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0B4000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MV_INIT</name>
              <description>Medium Voltage Level Select Initial</description>
              <bitOffset>14</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MV_END</name>
              <description>Medium Voltage Level Select Final</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MV_MISC</name>
              <description>Medium Voltage Control Misc</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPGM_INIT</name>
              <description>Program Current Control Initial</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPGM_END</name>
              <description>Program Current Control Final</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPGM_MISC</name>
              <description>Program Current Control Misc</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
