nxp-mcuxpresso/mcux-soc-svd/MCXN537/MCXN537_cm33_core0.xml
        <register>
          <name>REPAIR0_1</name>
          <description>FMU Repair 1 Block 0 Register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS0_1</name>
              <description>RDIS0_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz407</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz408</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR0_1</name>
              <description>RADR0_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REPAIR1_0</name>
          <description>FMU Repair 0 Block 1 Register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS1_0</name>
              <description>RDIS1_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz409</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz410</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR1_0</name>
              <description>RADR1_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REPAIR1_1</name>
          <description>FMU Repair 1 Block 1 Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RDIS1_1</name>
              <description>RDIS1_1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz411</name>
                  <description>Repair address is valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz412</name>
                  <description>Repair address is not valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RADR1_1</name>
              <description>RADR1_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMW_HB_SIGNALS</name>
          <description>SMW HB Signals Register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMW_ARRAY</name>
              <description>SMW Region Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz425</name>
                  <description>Main array</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz426</name>
                  <description>IFR space only or main (and REDEN space) with IFR space for mass erase</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz427</name>
                  <description>IFR1 space</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz428</name>
                  <description>REDEN space</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER_IFREN1</name>
              <description>IFR1 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz423</name>
                  <description>IFREN1 input to the flash array is driven LOW</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz424</name>
                  <description>IFREN1 input to the flash array is driven HIGH</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER_PV</name>
              <description>Program Verify</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz421</name>
                  <description>PV input to the flash array is driven LOW</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz422</name>
                  <description>PV input to the flash array is driven HIGH</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER_EV</name>
              <description>Erase Verify</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz419</name>
                  <description>EV input to the flash array is driven LOW</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz420</name>
                  <description>EV input to the flash array is driven HIGH</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER_IFREN</name>
              <description>IFR Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz417</name>
                  <description>IFREN input to the flash array is driven LOW</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz418</name>
                  <description>IFREN input to the flash array is driven HIGH</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER_REDEN</name>
              <description>Repair Read Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz415</name>
                  <description>REDEN input to the flash array is driven LOW</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz416</name>
                  <description>REDEN input to the flash array is driven HIGH</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USER_HEM</name>
              <description>High Endurance Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz413</name>
                  <description>HEM input to SMW / BIST PIN_CTRL[24] is driven LOW</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz414</name>
                  <description>HEM input to SMW / BIST PIN_CTRL[24] is driven HIGH</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BIST_DUMP_CTRL</name>
          <description>BIST Datadump Control Register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BIST_DONE</name>
              <description>BIST Done</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz439</name>
                  <description>The BIST (or data dump) is running</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz440</name>
                  <description>The BIST (or data dump) has completed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIST_FAIL</name>
              <description>BIST Fail</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz437</name>
                  <description>The last BIST operation completed successfully (or could not fail)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz438</name>
                  <description>The last BIST operation failed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATADUMP</name>
              <description>Data Dump Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATADUMP_TRIG</name>
              <description>Data Dump Trigger</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATADUMP_PATT</name>
              <description>Data Dump Pattern Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz433</name>
                  <description>All ones</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz434</name>
                  <description>All zeroes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz435</name>
                  <description>Checkerboard</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz436</name>
                  <description>Inverse checkerboard</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATADUMP_MRGEN</name>
              <description>Data Dump Margin Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz431</name>
                  <description>Normal read pulse shape</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz432</name>
                  <description>Margin read pulse shape</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATADUMP_MRGTYPE</name>
              <description>Data Dump Margin Type</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz429</name>
                  <description>DIN method used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz430</name>
                  <description>TM method used</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ATX_PIN_CTRL</name>
          <description>ATX Pin Control Register</description>
          <addressOffset>0x60C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TM_TO_ATX</name>
              <description>TM to ATX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>zz441</name>
                  <description>TM[0] to ATX0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz442</name>
                  <description>TM[1] to ATX0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz443</name>
                  <description>TM[2] to ATX0</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz444</name>
                  <description>TM[3] to ATX0</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz445</name>
                  <description>TM[0] to ATX1</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz446</name>
                  <description>TM[1] to ATX1</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz447</name>
                  <description>TM[2] to ATX1</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zz448</name>
                  <description>TM[3] to ATX1</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FAILCNT</name>
          <description>Fail Count Register</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAILCNT</name>
              <description>Fail Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGM_PULSE_CNT0</name>
          <description>Block 0 Program Pulse Count Register</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGM_CNT0</name>
              <description>Program Pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PGM_PULSE_CNT1</name>
          <description>Block 1 Program Pulse Count Register</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PGM_CNT1</name>
              <description>Program Pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERS_PULSE_CNT</name>
          <description>Erase Pulse Count Register</description>
          <addressOffset>0x61C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERS_CNT0</name>
              <description>Block 0 Erase Pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERS_CNT1</name>
              <description>Block 1 Erase Pulse Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAX_PULSE_CNT</name>
          <description>Maximum Pulse Count Register</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LAST_PCNT</name>
              <description>Last SMW Operation's Pulse Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_ERS_CNT</name>
              <description>Maximum Erase Pulse Count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_PGM_CNT</name>
              <description>Maximum Program Pulse Count</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
